---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectSomeDeleted
source: html/31c683ab-110b-9ead-ddb5-2e322e4becb1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PinnedObjectSomeDeleted Property

Some pinned objects were deleted while others were not.

## Syntax (C#)
```csharp
public static FailureDefinitionId PinnedObjectSomeDeleted { get; }
```